package com.example.charades.screens.game

class GameWordData {
    lateinit var wordList: MutableList<String>
    /**
     * Resets the list of words and randomizes the order
     */
     fun resetList() {
        wordList = mutableListOf(
            "Удача",
            "Свидание",
            "Хобби",
            "Стринги",
            "Зануда",
            "Удовольствие",
            "Хайп",
            "Красотка",
            "Танец живота",
            "Блогер",
            "Декольте",
            "Хаос",
            "Бегемот",
            "Проводница",
            "Хейтер",
            "Сердцеед",
            "Пехотинец",
            "Душа",
            "Стриптиз",
            "Зашквар",
            "Шантаж",
            "Женственность",
            "Ленивец",
            "Тверкинг",
            "Нудисты",
            "Кетчуп",
            "Дуэль",
            "Долг",
            "Проститутка",
            "Сладкоежка",
            "Лифчик",
            "Засос",
            "Краб",
            "Презерватив",
            "Неряха",
            "Вибратор",
            "Стыд",
            "Тамада",
            "Мордобой",
            "Чулки",
            "Ассенизатор",
            "Истерика",
            "Геморрой",
            "Щель",
            "Сосулька",
            "Кальсоны",
            "Писсуар",
            "Памперс"
        )
        wordList.shuffle()
    }

    fun remove() : String {
        return wordList.removeAt(0)
    }
}